In [1]:
import pandas as pd

In [12]:
#ans1

data=pd.Series([4,8,15,18,23,42])
data

0     4
1     8
2    15
3    18
4    23
5    42
dtype: int64

In [13]:
type(data)

pandas.core.series.Series

In [14]:
#ans2

list_1=[1,2,3,4,5,6,7,8,9,10]

df=pd.Series(list_1)
df

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [3]:
#ans3


table=pd.DataFrame({'Name':['Alice','Bob','Claire'],'Age':[25,30,27],"Gender":['Female','Male','Female']})

In [4]:
table

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

ans4

Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

1. Series

    1. Series is 1-Dimensional
    2. In Series all elements have same data types.
    3. Series is Immutable
    
2. Dataframe

    1. Series is 2-Dimensional
    2. Dataframe object can be difference data type.
    3. Series is mutable

In [5]:
#for example


df=pd.DataFrame({"Name":["Tej pal",'Abhishek','Suraj','Piyush'],
                 "Course":["B.tech",'B.tech','B.tech','B.pharma'],
                "Email":["Tejpal@gmail.com",'Abhishek@gmail.com','suraj@gmail.com','-']})

In [6]:
df

       Name    Course               Email
0   Tej pal    B.tech    Tejpal@gmail.com
1  Abhishek    B.tech  Abhishek@gmail.com
2     Suraj    B.tech     suraj@gmail.com
3    Piyush  B.pharma                   -

In [8]:
s=pd.Series([1,2,3,4,5,6,7,8])

In [9]:
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

ans5


In pandas there are many function which are used to manipulate the data .

for example-
    1. read_csv
    2. describe
    3.  head
    4. tail
    5. dtypes

In [10]:
dt=pd.read_csv("Player_per.csv")

In [11]:
dt.head()

,Unnamed: 0,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,4s,6s
0,0,Shubman Gill (GT),2023-2023,17,17,2,890,129,59.33,564,157.80,3,4,1,85,33
1,1,F du Plessis (RCB),2023-2023,14,14,1,730,84,56.15,475,153.68,-,8,-,60,36
2,2,DP Conway (CSK),2023-2023,16,15,2,672,92*,51.69,481,139.70,-,6,1,77,18
3,3,V Kohli (RCB),2023-2023,14,14,2,639,101*,53.25,457,139.82,2,6,1,65,16
4,4,YBK Jaiswal (RR),2023-2023,14,14,1,625,124,48.07,382,163.61,1,5,1,82,26

ans6


In Dataframe,Series,Panel  Dataframe are Mutable.

In DataFrame we can add new colums and drop a coluns and many operation.

In [14]:
#for example
dt["new_col"] = 0

In [16]:
dt.head()

,Unnamed: 0,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,4s,6s,new_col
0,0,Shubman Gill (GT),2023-2023,17,17,2,890,129,59.33,564,157.80,3,4,1,85,33,0
1,1,F du Plessis (RCB),2023-2023,14,14,1,730,84,56.15,475,153.68,-,8,-,60,36,0
2,2,DP Conway (CSK),2023-2023,16,15,2,672,92*,51.69,481,139.70,-,6,1,77,18,0
3,3,V Kohli (RCB),2023-2023,14,14,2,639,101*,53.25,457,139.82,2,6,1,65,16,0
4,4,YBK Jaiswal (RR),2023-2023,14,14,1,625,124,48.07,382,163.61,1,5,1,82,26,0

In [17]:
#ans7

s1=pd.Series(["tej pal","Abhishek",'Suraj',"Ram",'Geeta','Seeta'])

In [18]:
s2=pd.Series([18,20,17,10,29,23])

In [19]:
s3=pd.Series(["M",'M','M','M','F','F'])